---
type: MassLevelData
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 14
tags: [revit-api, class]
---

# MassLevelData

`Autodesk.Revit.DB.Analysis.MassLevelData` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsEmpty | 2012 | `public bool IsEmpty ()` |
| Method | IsMassFamilyInstance | 2012 | `public static bool IsMassFamilyInstance ( Document document , ElementId id )` |
| Method | IsValidConceptualConstructionTypeElement | 2012 | `public bool IsValidConceptualConstructionTypeElement ( ElementId id )` |
| Property | ConceptualConstructionId | 2012 | `public ElementId ConceptualConstructionId { get ; set ; }` |
| Property | ConceptualConstructionIsByEnergyData | 2012 | `public bool ConceptualConstructionIsByEnergyData { get ; set ; }` |
| Property | MaterialId | 2012 | `public ElementId MaterialId { get ; set ; }` |
| Property | MaterialType | 2012 | `public MassSurfaceDataMaterialType MaterialType { get ; set ; }` |
| Property | NExteriorSurfaceArea | 2012 | `public double NExteriorSurfaceArea { get ; }` |
| Property | NLevelFafArea | 2012 | `public double NLevelFafArea { get ; }` |
| Property | NLevelPerimeter | 2012 | `public double NLevelPerimeter { get ; }` |
| Property | NVolume | 2012 | `public double NVolume { get ; }` |
| Property | OwningMassId | 2012 | `public ElementId OwningMassId { get ; }` |
| Property | Parameter | — | `` |
| Property | StrUsage | 2012 | `public string StrUsage { get ; set ; }` |